{
  "id": "2c8b0e2b2146",
  "title": "Buku Panduan Mappi AI Hub.pdf",
  "chunks": [
    {
      "id": "2c8b0e2b2146-0",
      "docId": "2c8b0e2b2146",
      "text": "BUKU PANDUAN \nMAPPI AI HUB\n\n1 | MAPPI AI HUB \n \nKATA PENGANTAR \nPuji syukur kami panjatkan ke hadirat Tuhan Yang Maha Esa, karena berkat rahmat dan \nkarunia-Nya, kami dapat menyelenggarakan kegiatan Pelatihan Admin Mappi AI Hub di \nKabupaten Mappi, Papua Selatan, sebagai bagian dari rangkaian kegiatan AI Nusantara (AINUS). \nKegiatan ini merupakan langkah penting dalam meningkatkan literasi digital dan keterampilan \nteknologi di kalangan siswa dan pendidik di daerah ini. \nBupati Mappi, Kristosimus Yohanes Agawemu, dalam misinya untuk mengembangkan dan \nmeningkatkan kualitas Sumber Daya Manusia menuju generasi emas tahun 2045, berharap agar \nproses pembelajaran di setiap satuan pendidikan dapat mengintegrasikan kecerdasan buatan (AI) \ndalam pengajaran dan buku pelajaran. Bupati Mappi, yang akrab disapa Rito, juga mengharapkan \nAI dapat menjadi pendorong reformasi pendidikan di Mappi dan Indonesia. \nBuku panduan penggunaan Mappi AI Hub untuk admin di setiap sekolah hadir sebagai sumber \ninformasi yang komprehensif untuk mendukung para admin. Dengan perkembangan teknologi \ninformasi dan kecerdasan buatan yang semakin pesat, penting bagi kita untuk mempersiapkan \ngenerasi muda agar tidak hanya menjadi pengguna teknologi, tetapi juga pencipta dan \ninovator di dalamnya. \n \n \n\n2 | MAPPI AI HUB \n \n1. Pendahuluan \nSelamat datang di layanan EduBot. Asisten ini adalah sebuah sistem cerdas yang dirancang \nuntuk mempermudah kegiatan harian Anda, dan dapat diakses melalui aplikasi WhatsApp. \nDengan menggunakan teknologi terkini, robot asisten ini mampu memberikan informasi \ndengan cepat, membantu mengerjakan tugas, belajar, menerjemahkan dalam 27 bahasa, dan \nmemberikan layanan lainnya hanya dengan mengetik pesan di WhatsApp. \nSeiring perkembangan teknologi, semakin banyak kebutuhan akan asisten virtual yang bisa \ndiakses kapan saja dan di mana saja. EduBot hadir sebagai solusi dalam acara Mappi AI Hub, \nmemberikan pengalaman interaksi yang nyaman dan responsif melalui platform komunikasi \nyang sudah akrab bagi banyak orang: WhatsApp. Tidak perlu lagi mengunduh aplikasi \ntambahan, cukup dengan menyimpan kontak asisten ini di ponsel Anda, Anda sudah bisa mulai \nmenggunakan berbagai fitur yang ditawarkan. \nBuku panduan ini dirancang untuk membantu Anda memahami dan memaksimalkan \npenggunaan EduBot di WhatsApp. Kami akan menjelaskan langkah-langkah untuk memulai \npenggunaan, cara memanfaatkan berbagai fitur, serta memberikan panduan untuk mengatasi \nberbagai masalah yang mungkin Anda hadapi. Dengan begitu, Anda dapat merasakan manfaat \npenuh dari asisten virtual ini dalam mendukung aktivitas harian Anda. Mari kita mulai \npetualangan digital Anda dengan EduBot yang siap membantu kapan saja melalui Mappi AI \nHub \n2. Memulai Penggunaan \n \n• Langkah 1: Simpan Nomor Kontak Asisten \nTambahkan nomor robotnya ke daftar kontak di ponsel Anda. \n• Langkah 2: Mulai Percakapan \nBuka WhatsApp dan mulai percakapan baru dengan kontak yang telah disimpan. \nKirim pesan “nama keyword” untuk mulai menggunakan asisten \n• Langkah 3: Menggunakan Perintah \nInteraksi dengan asisten dapat dilakukan menggunakan perintah sederhana atau pesan \ndengan bahasa alami. Contoh perintah akan dijelaskan di bagian selanjutnya. \n \n3. Fitur Admin \n3.1. Bot Tidak Aktif \nKetika bot tidak aktif hal yang dapat dilakukan adalah: \n• Lakukan Chat di Grup “ Aktifasi” Sekolah masing-masing dengan memasukan \ncommand “cekbot mappi nama robot” \n• Untuk mengetahui nama robot bisa dibuka di perangkat tertaut, lalu nama robot \nakan Nampak disitu \n \n \n\n3 | MAPPI AI HUB \n \n3.2. Menambahkan admin \n• Ketikan “setadmin no hp yg akan dijadikan” di chat nomor yang akan dijadikan \nadmin, contoh: \nSetadmin 0812345678 \n \n \n \n \n• Jika berhasil robot akan merespon seperti pada gambar berikut: \n \n \n \n \n3.3.Melihat Daftar Admin \n• Ketikan “listadmin” di kolom chat, contoh: \nListadmin \n \n \n \n \n \n \n \n \n \n \n \n \n \n3.4.Menghapus Admin \n• Ketikan “deladmin no hp admin yang akan dihapus” di kolom chat, contoh: \nDeladmi"
    },
    {
      "id": "2c8b0e2b2146-1",
      "docId": "2c8b0e2b2146",
      "text": "setadmin no hp yg akan dijadikan” di chat nomor yang akan dijadikan \nadmin, contoh: \nSetadmin 0812345678 \n \n \n \n \n• Jika berhasil robot akan merespon seperti pada gambar berikut: \n \n \n \n \n3.3.Melihat Daftar Admin \n• Ketikan “listadmin” di kolom chat, contoh: \nListadmin \n \n \n \n \n \n \n \n \n \n \n \n \n \n3.4.Menghapus Admin \n• Ketikan “deladmin no hp admin yang akan dihapus” di kolom chat, contoh: \nDeladmin 0812345678 \n \n \n \n \n \n \n \n \n\n4 | MAPPI AI HUB \n \n3.5. Mengubah keyword robot / Panggilan robot \n \n• Ketikan “setkeyword keyword barunya” di kolom chat \ncontoh: \nSetkeyword mappi \n \n \n \n \n \n3.6. Mematikan fitur jawab otomatis \n• Apabila bapak/ibu ingin robotnya tidak sering menjawab otomatis dapat \ndimasukan command berikut: \n“reply” ketikan kata tersebut di kolom chat nya \n \n \n \n \n \n \n \n3.7. Fitur Buka Gambar \n• Supaya akses request gambar dapat diminta oleh semua orang, commandnya \nadalah sebagai berikut: \n“bukagambar on” ( untuk mengaktifkan fitur buka gambar) \n “bukagambar off” (untuk mematikan fitur buka gambar) \n \n \n3.8.Fitur Voice \n• Supaya robot dapat menjawab dengan suara saat menerjemahkan kalimat, \ncommandnya adalah sebagai berikut: \n“voice” \n \n \n \n \n\n5 | MAPPI AI HUB \n \n \n \n3.9.Fitur Input Konten \n• Untuk dapat menginput konten ke dalam robot bisa menggunakan command \nInput Konten \nMasukan konten yang akan dimasuka \n \nInput konten \nNama Sekolah = ....... \nNama kepala sekolah = ....... \nJumlah SIswa = ....... \nJumlah Guru = ....... \n \n3.10. Fitur Input Vidio \n• Untuk dapat menginput konten ke dalam robot bisa menggunakan command \ninput video \nkelas = ....... \nMapel = ....... \nSubbab = ....... \nlink 1= ...... \n \n \n \n \n \n\n6 | MAPPI AI HUB \n \n• Untuk mencari video nya menggunakan Command: \n \n!cari video kelas ..... mapel..... subbab......... \n \n \n \n \n \n \n \n3.11. Fitur Input PDF \n• Untuk dapat menginput konten ke dalam robot bisa menggunakan command \ninput pdf kelas = ....... , Mapel = ....... , Subbab = ....... , judul = ...... \n \nUntuk mencari video nya menggunakan Command: \n \n!cari pdf kelas ..... mapel..... subbab......... \n \n \n\n7 | MAPPI AI HUB \n \n4. Fitur Edubot untuk user \n4.1. Tanya Edubot \nFitur ini untuk bertanya hal apapun ke dalam edubot: \n \nContoh: Guru berikan saya resep lezat yang mencakup makanan yang bergizi bermanfaat \ntetapi juga mudah & tidak memakan waktu sehingga cocok untuk orang sibuk seperti kita di \nantara faktor-faktor lain seperti efektivitas biaya sehingga hidangan secara keseluruhan \nmenjadi sehat namun tetap ekonomis. waktu! Permintaan pertama saya Sesuatu yang ringan \nnamun memuaskan yang bisa dimasak dengan cepat saat istirahat makan siang. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n4.2. Seputar Pendidikan \nFitur ini untuk bertanya hal apapun mengenai Pendidikan ke dalam edubot: \n \nContoh: Guru buatkan saya konten pendidikan yang menarik dan informatif untuk materi \npembelajaran seperti buku teks, kursus online, dan catatan kuliah. Permintaan saran pertama \nsaya adalah saya memerlukan bantuan untuk mengembangkan rencana pelajaran tentang \nsumber energi terbarukan untuk siswa sekolah menengah. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n8 | MAPPI AI HUB \n \n4.3. Menerjemahkan Tulisan Kedalam JPG \nFitur ini berguna untuk menerjemahkan tulisan yang ada di gambar \nContoh: Guru terjemahkan tulisan di gambar ini ke dalam bahasa inggris \n \n \n \n4.4. Generate Gambar \nFitur ini dipakai untuk melakukan generate gambar \nContoh: Guru buatkan saya gambar dua rumah berseberangan di kaki gunung dengan \npemandangan sawah di sore hari dengan matahari terbenam. \n \n \n \n \n4.5. Penerjemah Bahasa \nFitur ini digunakan untuk menerjemahkan Bahasa, terdapat 27 bahasa yang dapat di \nterjemahkan, caranya adalah Blist (untuk melihat list kode bahasa) dan Bb[kode bahasa] \nContoh: Bben saya ingin pergi ke pasar besok, tolong bangunkan saya di pagi hari. \n(menerjemahkan kedalam bahasa inggris). \n \n\n9 | MAPPI AI HUB \n \n \n \n \n \n \n \n \n \n \n4.6. Cari Informasi Terkini \nFitur ini digunakan untuk mencari informasi terkini caranya adalah memasukan command “ca"
    },
    {
      "id": "2c8b0e2b2146-2",
      "docId": "2c8b0e2b2146",
      "text": "apat 27 bahasa yang dapat di \nterjemahkan, caranya adalah Blist (untuk melihat list kode bahasa) dan Bb[kode bahasa] \nContoh: Bben saya ingin pergi ke pasar besok, tolong bangunkan saya di pagi hari. \n(menerjemahkan kedalam bahasa inggris). \n \n\n9 | MAPPI AI HUB \n \n \n \n \n \n \n \n \n \n \n4.6. Cari Informasi Terkini \nFitur ini digunakan untuk mencari informasi terkini caranya adalah memasukan command “cari \ninfo yang akan dicari” \nContoh: Cari berita terkini mengenai pilkada 2024 di daerah jawa barat dan isu isu politiknya. \n \n \n\nHilwan Nasep\n0838-1529-0344\nCONTACT PERSON\nCREATED BY\nDAVI HANAN LUTHFI ABIYYU\nHILWAN NASEP"
    }
  ]
}